Project/Toir.Adaptation/src/InformationRegisters/торо_ДанныеАСУТП/торо_ДанныеАСУТП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d0f45d1e-82ba-484a-bdb0-122d9d61b397">
  <name>торо_ДанныеАСУТП</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="8151974e-088b-4b13-91e7-9c07591ae504">
    <name>Ошибка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d4e19327-e374-4674-961c-1fe227487121">
    <name>Обработан</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="39f215a5-ba6e-4b15-9199-8fb11a1d932f">
    <name>Подключение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6cebbf42-71c2-4053-ab55-4e594703b8ff">
    <name>ИДСеанса</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Catalogs/торо_ПодключенияКБазеДанных/торо_ПодключенияКБазеДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ПодключенияКБазеДанных</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ИспользоватьПометкуДанных</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользованиеРазбиениеДанныхНаПорции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Отключен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Логин</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>БазаДанных</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТекстЗапросаЧтения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекстЗапросаПометкиОбрабатываемых</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьУдалениеДанных</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекстЗапросаУдаленияОбработанных</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Project/Toir.Adaptation/src/CommonModules/торо_ПолучениеДанныхАСУТП/Module.bsl
#Область СлужебныеПроцедурыИФункции

&Вместо("ПодключитьсяИВыполнитьЗапрос")
Процедура Расш_гкс_ПодключитьсяИВыполнитьЗапрос(текИсточник, Ошибка)
	Этап = Перечисления.торо_ОшибкиАСУТП.Подключение;
	КоличествоЗагруженныхЗаписей = 0;
	ТекДата = ТекущаяДата();
	ОтступатьС = Константы.торо_ОтступВСекундахАСУТП.Получить();
	// гкс+ [Интеграция] Куст 17.03.2020
	МинДатаОбмена = Константы.гкс_МинимальнаяДатаОбменаАСУТП.Получить();
	МаксДатаОбмена = НачалоДня(ТекущаяДата())-1;
	ГраницаПолученияДанныхНачало = Дата(1,1,1);
	
	Если текИсточник.гкс_СписокТегов > 0 Тогда 
		МассивТеговРегистра = ПолучитьМассивТегов(текИсточник.гкс_СписокТегов);
	Иначе
		МассивТеговРегистра = Новый Массив();
		МассивТеговРегистра.Добавить("0");
	КонецЕсли;
	// гкс- [Интеграция] Куст 17.03.2020
	
	Порция = текИсточник.РазмерПорции;
	Если текИсточник.ИспользованиеРазбиениеДанныхНаПорции = истина Тогда
		// гкс+ [Интеграция] Куст 17.03.2020
		Если текИсточник.гкс_ПорцияДень = Истина Тогда 
			ТемпДата = Макс(ТекИсточник.ДатаПрошлогоСеанса,МинДатаОбмена);
			ГраницаПолученияДанныхНачало = НачалоДня(ТемпДата);
			ГраницаПолученияДанныхКонец = КонецДня(ТемпДата);
		Иначе
			ГраницаПолученияДанныхНачало = Макс(ТекИсточник.ДатаПрошлогоСеанса,МинДатаОбмена);
			ГраницаПолученияДанныхКонец = ГраницаПолученияДанныхНачало + Порция;
		КонецЕсли;
		// гкс- [Интеграция] Куст 17.03.2020
	КонецЕсли;
	
	Попытка
		ИДСеанса = Новый УникальныйИдентификатор;
		
		Подключение = Новый COMОбъект("ADODB.Connection");
		Подключение.ConnectionTimeOut = 30;
		Подключение.connectionString = "SERVER="+СокрЛП(текИсточник.Адрес)+
			"; Database = "+СокрЛП(текИсточник.ИмяБД)+
			"; DRIVER=SQL Server; UID="+СокрЛП(текИсточник.Логин)+
			"; PWD="+СокрЛП(текИсточник.Пароль)+";";
		Подключение.Open();
		
		Command = Новый COMОбъект("ADODB.Command");
		Command.ActiveConnection = Подключение;
		Command.CommandTimeOut = 30;
		Command.CommandType = 1;
		
		Если текИсточник.ИспользованиеРазбиениеДанныхНаПорции = Истина Тогда
			p1 = Command.CreateParameter("@P1",200,1,255,Формат(ГраницаПолученияДанныхНачало,"ДФ='ггггММдд ЧЧ:мм:сс'"));
			Command.Parameters.Append(p1);
			p2 = Command.CreateParameter("@P2",200,1,255,Формат(ГраницаПолученияДанныхКонец,"ДФ='ггггММдд ЧЧ:мм:сс'"));
			Command.Parameters.Append(p2);
		Иначе
			p1 = Command.CreateParameter("@P1",200,1,255,Формат(ТекДата-ОтступатьС,"ДФ='ггггММдд ЧЧ:мм:сс'"));
			Command.Parameters.Append(p1);
		КонецЕсли;
		Command.Parameters.Refresh();
		
		тз = Новый ТаблицаЗначений;
		тз.Колонки.Добавить("НаименованиеОР", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
		тз.Колонки.Добавить("Тег", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
		тз.Колонки.Добавить("Подключение", новый ОписаниеТипов("СправочникСсылка.торо_ПодключенияКБазеДанных"));
		тз.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		тз.Колонки.Добавить("МеткаВремени", Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		тз.Колонки.Добавить("Значение", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15,3)));
		тз.Колонки.Добавить("Ошибка", Новый ОписаниеТипов("Булево"));
		тз.Колонки.Добавить("Обработан", Новый ОписаниеТипов("Булево"));
		
		КоличествоЗагруженныхЗаписей = 0;
		Закончить = Ложь;
		// гкс+ [Интеграция] Куст 17.03.2020
		ПоследняяМаксимальнаяДата = ГраницаПолученияДанныхНачало;
		// гкс- [Интеграция] Куст 17.03.2020
		
		Пока Истина Цикл
			
			Если Закончить = Истина Тогда
				Прервать;
			КонецЕсли;
			
			Если текИсточник.ИспользованиеРазбиениеДанныхНаПорции = Истина Тогда
				// гкс+ [Интеграция] Куст 17.03.2020
				Если текИсточник.гкс_ПорцияДень = Истина Тогда 
					Если ГраницаПолученияДанныхКонец > МаксДатаОбмена Тогда 
						Прервать;
					КонецЕсли;
					ТемпДата = ГраницаПолученияДанныхНачало + 1;
					ГраницаПолученияДанныхНачало = НачалоДня(ТемпДата);
					ГраницаПолученияДанныхКонец = КонецДня(ТемпДата);
					
					Если ГраницаПолученияДанныхКонец >= (ТекДата - ОтступатьС) ИЛИ ГраницаПолученияДанныхКонец >= МаксДатаОбмена Тогда 
						Закончить = Истина;
					КонецЕсли;
				Иначе
					ГраницаПолученияДанныхКонец = ГраницаПолученияДанныхНачало + Порция;
					Если ГраницаПолученияДанныхКонец >= (ТекДата - ОтступатьС) Тогда 
						Закончить = Истина;
					КонецЕсли;
					
					ГраницаПолученияДанныхКонец = Мин(ГраницаПолученияДанныхКонец, (ТекДата - ОтступатьС));
				КонецЕсли;
				// гкс- [Интеграция] Куст 17.03.2020
			
				p1 = Command.Parameters.Item(0);
				p1.value = Формат(ГраницаПолученияДанныхНачало,"ДФ='ггггММдд ЧЧ:мм:сс'");
				p2 = Command.Parameters.Item(1);
				p2.value = Формат(ГраницаПолученияДанныхКонец,"ДФ='ггггММдд ЧЧ:мм:сс'");
			Иначе
				Закончить = Истина;
			КонецЕсли;
			
			Если текИсточник.ИспользоватьПометкуДанных Тогда
				Command.CommandText = текИсточник.ТекстЗапросаПометки;
				Выборка = Command.Execute();
			КонецЕсли;
			// гкс+ [Интеграция] Куст 17.03.2020
			Для Каждого ТекТег ИЗ МассивТеговРегистра Цикл
				Если текИсточник.гкс_ПорцияДень = Истина И текИсточник.гкс_СписокТегов > 0 Тогда 
					Command.CommandText = СтрЗаменить(текИсточник.ТекстЗапросаЧтения,"СписокТегов",ТекТег);
				Иначе
					Command.CommandText = текИсточник.ТекстЗапросаЧтения;
				КонецЕсли;
			// гкс- [Интеграция] Куст 17.03.2020
				Выборка = Command.Execute();
				
				ИДСеанса = Новый УникальныйИдентификатор;
				Этап = Перечисления.торо_ОшибкиАСУТП.ЧтениеДанных;
				тз.Очистить();
				
				Записывать = Ложь;
				Если Выборка.BOF = Ложь и Выборка.EOF = Ложь Тогда 
					масSafeArray = Выборка.GetRows();
					масПростоМассив = масSafeArray.Выгрузить();
					Для каждого текСтрока из масПростоМассив Цикл
						нс = тз.Добавить();
						нс.НаименованиеОР = текСтрока[0];
						нс.Тег = текСтрока[1];
						нс.Дата = текСтрока[2];
						// гкс+ [Интеграция] Куст 17.03.2020
						ИндексЯчейкиМассиваСодержащейДату = 2;
						Если нс.Дата = Дата(1,1,1) И ЗначениеЗаполнено(текСтрока[ИндексЯчейкиМассиваСодержащейДату]) Тогда 
							нс.Дата = РаспознатьДату(СокрЛП(текСтрока[ИндексЯчейкиМассиваСодержащейДату]));
						КонецЕсли;
						ПоследняяМаксимальнаяДата = Макс(ПоследняяМаксимальнаяДата,нс.Дата);
						// гкс- [Интеграция] Куст 17.03.2020
						нс.Значение = текСтрока[3];
						нс.Подключение = текИсточник.Подключение;
						Записывать = Истина;
					КонецЦикла;
					// гкс+ [Интеграция] Куст 17.03.2020
				Иначе
					ПоследняяМаксимальнаяДата = ГраницаПолученияДанныхКонец;
					// гкс- [Интеграция] Куст 17.03.2020
				КонецЕсли;
				Выборка.Close();
				
				Если Записывать = Истина Тогда
					нз = РегистрыСведений.торо_ДанныеАСУТП.СоздатьНаборЗаписей();
					нз.Отбор.ИДСеанса.Установить(ИДСеанса);
					тз.ЗаполнитьЗначения(Ложь, "Ошибка");
					тз.ЗаполнитьЗначения(Ложь, "Обработан");
					тз.ЗаполнитьЗначения(Дата(Год(ТекущаяДата()), Месяц(ТекущаяДата()), День(ТекущаяДата()), Час(ТекущаяДата()),0,0), "МеткаВремени");
					
					НомерПП = 1;
					Для каждого текСтрока из тз Цикл
						нс = нз.Добавить();
						нс.ИДСеанса = ИДСеанса;
						нс.ИДЗаписи = НомерПП;
						НомерПП = НомерПП + 1;
						ЗаполнитьЗначенияСвойств(нс, текСтрока);
					КонецЦикла;
					
					КоличествоЗагруженныхЗаписей = КоличествоЗагруженныхЗаписей + нз.Количество();
					нз.Записать(Истина);
				КонецЕсли;
			
				Если текИсточник.ИспользоватьУдалениеДанных Тогда
					Command.CommandText = текИсточник.ТекстЗапросаУдаления;
					Выборка = Command.Execute();
				КонецЕсли;
				// гкс+ [Интеграция] Куст 17.03.2020
				ГраницаПолученияДанныхНачало = Мин(ПоследняяМаксимальнаяДата,ГраницаПолученияДанныхКонец);
			КонецЦикла;
			// гкс- [Интеграция] Куст 17.03.2020
		КонецЦикла;
		
	Исключение
		Ошибка = Истина;
		КоличествоЗагруженныхЗаписей = 0;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), УровеньЖурналаРегистрации.Предупреждение,,,ОписаниеОшибки);
		ЗарегистрироватьОшибкуИнтеграции(текИсточник, Этап, ОписаниеОшибки, ИДСеанса);
	КонецПопытки;
	
	Попытка
		Подключение.Close();
	Исключение
		ТекстСообщения = НСтр("es='La falta al cierre de la conexión.';ru='Ошибка при закрытии подключения.';en='Error closing connection.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	СделатьЗаписьВРегистрСеансов(текИсточник, КоличествоЗагруженныхЗаписей, ТекДата);
КонецПроцедуры

// гкс+ [Интеграция] Куст 17.03.2020
Функция РаспознатьДату(Текст)
	ОжидаемоеКОличествоЧастейДаты = 6;
	ИндексЧастиГод = 0;
	ИндексЧастиМесяц = 1;
	ИндексЧастиДень = 2;
	ИндексЧастиЧас = 3;
	ИндексЧастиМинута = 4;
	ИндексЧастиСекунда = 5;
	МассивСтрокЧастейДаты = СтрРазделить(Текст,":.,- ",Ложь);
	Если МассивСтрокЧастейДаты.Количество() = ОжидаемоеКОличествоЧастейДаты Тогда 
		Возврат Дата(МассивСтрокЧастейДаты[ИндексЧастиГод],
			МассивСтрокЧастейДаты[ИндексЧастиМесяц],
			МассивСтрокЧастейДаты[ИндексЧастиДень],
			МассивСтрокЧастейДаты[ИндексЧастиМинута],
			МассивСтрокЧастейДаты[ИндексЧастиМинута],
			МассивСтрокЧастейДаты[ИндексЧастиСекунда]);
	КонецЕсли;
	ГодПоУмолчанию = 1;
	МесяцПоУмолчанию = 1;
	ДеньПоУмолчанию = 1;
	Возврат Дата(ГодПоУмолчанию,МесяцПоУмолчанию,ДеньПоУмолчанию);
КонецФункции
// гкс- [Интеграция] Куст 17.03.2020

// гкс+ [Интеграция] Куст 17.03.2020
Функция ПолучитьМассивТегов(Ключ)
	КВозврату = Новый Массив();
	Если Ключ = 1 Тогда //Наработка
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	гкс_ТегиНаработки.Тег КАК Тег
			|ИЗ
			|	РегистрСведений.гкс_ТегиНаработки КАК гкс_ТегиНаработки";
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			КВозврату.Добавить(Выборка.Тег);
		КонецЦикла;
	ИначеЕсли Ключ = 2 Тогда //Показатели
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	гкс_ТегиПоказателей.Тег КАК Тег
			|ИЗ
			|	РегистрСведений.гкс_ТегиПоказателей КАК гкс_ТегиПоказателей";
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			КВозврату.Добавить(Выборка.Тег);
		КонецЦикла;
	КонецЕсли;
	Возврат КВозврату;
КонецФункции
// гкс- [Интеграция] Куст 17.03.2020

&ИзменениеИКонтроль("ПолучитьДанные")
Процедура Расш_гкс_ПолучитьДанные(Подключение)

	Если Константы.торо_ОтладкаАСУТП_ЗагрузкаДанныхИзМакета.Получить() Тогда
		ПолучитьДанныеОтладка();
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_ПодключенияКБазеДанных.Сервер КАК Адрес,
	|	торо_ПодключенияКБазеДанных.БазаДанных КАК ИмяБД,
	|	торо_ПодключенияКБазеДанных.Логин КАК Логин,
	|	торо_ПодключенияКБазеДанных.Пароль КАК Пароль,
	|	торо_ПодключенияКБазеДанных.Ссылка КАК Ссылка,
	|	торо_ПодключенияКБазеДанных.ПериодПолученияДанных КАК ПериодПолученияДанных,
	|	торо_ПодключенияКБазеДанных.ТекстЗапросаЧтения КАК ТекстЗапросаЧтения,
	|	торо_ПодключенияКБазеДанных.ТекстЗапросаПометкиОбрабатываемых КАК ТекстЗапросаПометки,
	|	торо_ПодключенияКБазеДанных.ТекстЗапросаУдаленияОбработанных КАК ТекстЗапросаУдаления,
	|	торо_ПодключенияКБазеДанных.ИспользоватьПометкуДанных КАК ИспользоватьПометкуДанных,
	|	торо_ПодключенияКБазеДанных.ИспользоватьУдалениеДанных КАК ИспользоватьУдалениеДанных,
	|	торо_ПодключенияКБазеДанных.ИспользованиеРазбиениеДанныхНаПорции КАК ИспользованиеРазбиениеДанныхНаПорции,
	#Вставка
	|	торо_ПодключенияКБазеДанных.гкс_ПорцияДень КАК гкс_ПорцияДень,
    |	торо_ПодключенияКБазеДанных.гкс_СписокТегов КАК гкс_СписокТегов,
    #КонецВставки
	|	торо_ПодключенияКБазеДанных.РазмерПорции КАК РазмерПорции
	|ПОМЕСТИТЬ Источники
	|ИЗ
	|	Справочник.торо_ПодключенияКБазеДанных КАК торо_ПодключенияКБазеДанных
	|ГДЕ
	|	торо_ПодключенияКБазеДанных.ПометкаУдаления = ЛОЖЬ
	|	И торо_ПодключенияКБазеДанных.Отключен = ЛОЖЬ
	|	И (торо_ПодключенияКБазеДанных.Ссылка = &Подключение
	|			ИЛИ &Подключение = НЕОПРЕДЕЛЕНО)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_СеансыОбменаСрезПоследних.Период КАК Период,
	|	торо_СеансыОбменаСрезПоследних.Подключение КАК Подключение
	|ПОМЕСТИТЬ Сеансы
	|ИЗ
	|	РегистрСведений.торо_СеансыОбменаСАСУТП.СрезПоследних КАК торо_СеансыОбменаСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Подключение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Источники.Адрес КАК Адрес,
	|	Источники.ИмяБД КАК ИмяБД,
	|	Источники.Логин КАК Логин,
	|	Источники.Пароль КАК Пароль,
	|	Источники.Ссылка КАК Подключение,
	|	Источники.Ссылка.Наименование КАК НаименованиеПодключения,
	|	Источники.ТекстЗапросаЧтения КАК ТекстЗапросаЧтения,
	|	Источники.ТекстЗапросаПометки КАК ТекстЗапросаПометки,
	|	Источники.ТекстЗапросаУдаления КАК ТекстЗапросаУдаления,
	|	Источники.ИспользоватьПометкуДанных КАК ИспользоватьПометкуДанных,
	|	Источники.ИспользоватьУдалениеДанных КАК ИспользоватьУдалениеДанных,
	|	ЕСТЬNULL(Сеансы.Период, ДАТАВРЕМЯ(1980, 1, 1, 0, 0, 0)) КАК ДатаПрошлогоСеанса,
	|	Источники.ИспользованиеРазбиениеДанныхНаПорции КАК ИспользованиеРазбиениеДанныхНаПорции,
	|	Источники.РазмерПорции КАК РазмерПорции
	#Вставка
	|	Источники.гкс_ПорцияДень КАК гкс_ПорцияДень,
	|	Источники.гкс_СписокТегов КАК гкс_СписокТегов,
	#КонецВставки
	|ИЗ
	|	Источники КАК Источники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Сеансы КАК Сеансы
	|		ПО Источники.Ссылка = Сеансы.Подключение
	|ГДЕ
	|	ДОБАВИТЬКДАТЕ(ЕСТЬNULL(Сеансы.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)), СЕКУНДА, Источники.ПериодПолученияДанных) < &ТекДата";

	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Подключение", Подключение);
	резЗапроса = Запрос.Выполнить();

	Если резЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	ИсточникиДанных = резЗапроса.Выбрать();

	Ошибка = Ложь;
	Пока ИсточникиДанных.Следующий() Цикл
		ПодключитьсяИВыполнитьЗапрос(ИсточникиДанных, Ошибка);
	КонецЦикла;

КонецПроцедуры

&ИзменениеИКонтроль("ПолучитьДанныеОтладка")
Процедура Расш_гкс_ПолучитьДанныеОтладка()

	Макет = ПолучитьОбщийМакет("торо_ОтладочныеДанныеАСУТП");
	ПостроительЗапроса = новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(Макет.Область("Данные"));
	ПостроительЗапроса.Выполнить();
	тзМакета = ПостроительЗапроса.Результат.Выгрузить();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Таб.Подключение КАК Подключение,
	|	Таб.ORName КАК наименованиеОР,
	|	Таб.Tag КАК Тег,
	|	Таб.Date КАК Дата,
	|	Таб.Value КАК Значение
	|ПОМЕСТИТЬ ДанныеИзМакета
	|ИЗ
	|	&Таб КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеИхМакета.наименованиеОР КАК наименованиеОР,
	|	ДанныеИхМакета.Тег КАК Тег,
	|	ДанныеИхМакета.Дата КАК Дата,
	|	ДанныеИхМакета.Значение КАК Значение,
	|	ДанныеИхМакета.Подключение КАК ПодключениеНаименованиеИзМакета,
	|	торо_ПодключенияКБазеДанных.Ссылка КАК Подключение,
	|	торо_ПодключенияКБазеДанных.Наименование КАК Наименование
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	ДанныеИзМакета КАК ДанныеИхМакета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ПодключенияКБазеДанных КАК торо_ПодключенияКБазеДанных
	|		ПО ДанныеИхМакета.Подключение = торо_ПодключенияКБазеДанных.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.наименованиеОР КАК наименованиеОР,
	|	Данные.Тег КАК Тег,
	|	Данные.Дата КАК Дата,
	|	Данные.Значение КАК Значение,
	|	Данные.ПодключениеНаименованиеИзМакета КАК ПодключениеНаименованиеИзМакета,
	|	Данные.Подключение КАК Подключение,
	|	Данные.Наименование КАК Наименование,
	|	ВЫБОР
	|		КОГДА Данные.Подключение ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПодключениеРаспознано
	|ИЗ
	|	Данные КАК Данные
	|ИТОГИ
	|	МАКСИМУМ(ПодключениеРаспознано)
	|ПО
	|	Подключение";

	Запрос.УстановитьПараметр("Таб", тзМакета);

	резЗапроса = Запрос.Выполнить();

	Если НЕ резЗапроса.Пустой() Тогда
		Выборка = резЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		струкДанных = Новый Структура("Подключение");
		Попытка
			МеткаВремени = Дата(Год(ТекущаяДата()), Месяц(ТекущаяДата()), День(ТекущаяДата()), Час(ТекущаяДата()),0,0);
			Пока Выборка.Следующий() Цикл
				ИДСеанса = Новый УникальныйИдентификатор;
				Ошибка = Ложь;
				КоличествоЗагруженныхЗаписей = 0;
				струкДанных.Подключение = Выборка.ПодключениеНаименованиеИзМакета;

				Если Выборка.ПодключениеРаспознано Тогда 
					текСтрока = Выборка.Выбрать();
					нз = РегистрыСведений.торо_ДанныеАСУТП.СоздатьНаборЗаписей();
					нз.Отбор.ИДСеанса.Установить(ИДСеанса);

					НомерПП = 1;
					Пока текСтрока.Следующий() цикл
						нс = нз.Добавить();
						ЗаполнитьЗначенияСвойств(нс, текСтрока);
						нс.ИДСеанса = ИДСеанса;
						нс.ИДЗаписи = НомерПП;
						НомерПП = НомерПП + 1;
						нс.Ошибка = Ложь;
						нс.МеткаВремени = МеткаВремени;
						нс.Дата = Дата(текСтрока.дата);
						нс.Обработан = Ложь;
					КонецЦикла;

					КоличествоЗагруженныхЗаписей = нз.Количество();
					нз.Записать(Истина);
				Иначе 
					ВызватьИсключение "Подключение из макета не опознано.";
				КонецЕсли;

				СделатьЗаписьВРегистрСеансов(Выборка, КоличествоЗагруженныхЗаписей, ТекущаяДата());
			КонецЦикла;
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			#Удаление
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Исключение'"), УровеньЖурналаРегистрации.Предупреждение,,,ОписаниеОшибки);
			#КонецУдаления
			#Вставка
			ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"),
				УровеньЖурналаРегистрации.Предупреждение,,, ОписаниеОшибки);
			#КонецВставки
			ЗарегистрироватьОшибкуИнтеграции(струкДанных, Перечисления.торо_ОшибкиАСУТП.ЧтениеДанныхИзМакета, ОписаниеОшибки, ИДСеанса);
			СделатьЗаписьВРегистрСеансов(струкДанных, КоличествоЗагруженныхЗаписей, ТекущаяДата());
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
